export const check = [
	{
		id: 71,
		title: "Какие технологии могут быть использованы в сетях 2G?",
		type: "check",
		body: [
			{
				ques: "GSM",
				user_res: "",
			},
			{
				ques: "CDMA",
				user_res: "",
			},
			{
				ques: "Bluetooth",
				user_res: "",
			},
			{
				ques: "Wi-Fi",
				user_res: "",
			},
		],
		res: [
			{
				ques: "GSM",
				res: "Правильный",
			},
			{
				ques: "CDMA",
				res: "Правильный",
			},
			{
				ques: "Bluetooth",
				res: "",
			},
			{
				ques: "Wi-Fi",
				res: "",
			},
		],
	},
	{
		id: 72,
		title: "Какие частотные диапазоны могут использоваться в сетях 3G?",
		type: "check",
		body: [
			{
				ques: "850 МГц",
				user_res: "",
			},
			{
				ques: "5 ГГц",
				user_res: "",
			},
			{
				ques: "2100 МГц",
				user_res: "",
			},
			{
				ques: "30 ГГц",
				user_res: "",
			},
		],
		res: [
			{
				ques: "850 МГц",
				res: "Правильный",
			},
			{
				ques: "5 ГГц",
				res: "",
			},
			{
				ques: "2100 МГц",
				res: "Правильный",
			},
			{
				ques: "30 ГГц",
				res: "",
			},
		],
	},
	{
		id: 76,
		title: "Какие технологии используются в сетях 4G?",
		type: "check",
		body: [
			{
				ques: "LTE",
				user_res: "",
			},
			{
				ques: "GSM",
				user_res: "",
			},
			{
				ques: "EDGE",
				user_res: "",
			},
			{
				ques: "WiMAX",
				user_res: "",
			},
		],
		res: [
			{
				ques: "LTE",
				res: "Правильный",
			},
			{
				ques: "GSM",
				res: "",
			},
			{
				ques: "EDGE",
				res: "",
			},
			{
				ques: "WiMAX",
				res: "Правильный",
			},
		],
	},
	{
		id: 77,
		title: "Какая основная техника модуляции используется в сетях 3G?",
		type: "check",
		body: [
			{
				ques: "FDMA",
				user_res: "",
			},
			{
				ques: "CDMA",
				user_res: "",
			},
			{
				ques: "TDMA",
				user_res: "",
			},
			{
				ques: "OFDMA",
				user_res: "",
			},
		],
		res: [
			{
				ques: "FDMA",
				res: "",
			},
			{
				ques: "CDMA",
				res: "Правильный",
			},
			{
				ques: "TDMA",
				res: "",
			},
			{
				ques: "OFDMA",
				res: "",
			},
		],
	},
	{
		id: 78,
		title: "Какие частотные диапазоны обычно используются в сетях 2G?",
		type: "check",
		body: [
			{
				ques: "900 МГц",
				user_res: "",
			},
			{
				ques: "1800 МГц",
				user_res: "",
			},
			{
				ques: "2.4 ГГц",
				user_res: "",
			},
			{
				ques: "5 ГГц",
				user_res: "",
			},
		],
		res: [
			{
				ques: "900 МГц",
				res: "Правильный",
			},
			{
				ques: "1800 МГц",
				res: "Правильный",
			},
			{
				ques: "2.4 ГГц",
				res: "",
			},
			{
				ques: "5 ГГц",
				res: "",
			},
		],
	},
	{
		id: 79,
		title: "Какова цель устройства Home NodeB (HNB) в сетях 3G?",
		type: "check",
		body: [
			{
				ques: "Предоставление покрытия в закрытых помещениях",
				user_res: "",
			},
			{
				ques: "Повышение пропускной способности сети",
				user_res: "",
			},
			{
				ques: "Обеспечение межсистемного роуминга",
				user_res: "",
			},
			{
				ques: "Управление мобильным трафиком",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Предоставление покрытия в закрытых помещениях",
				res: "Правильный",
			},
			{
				ques: "Повышение пропускной способности сети",
				res: "",
			},
			{
				ques: "Обеспечение межсистемного роуминга",
				res: "",
			},
			{
				ques: "Управление мобильным трафиком",
				res: "",
			},
		],
	},
	{
		id: 80,
		title: "Какие технологии используются в сетях 5G?",
		type: "check",
		body: [
			{
				ques: "5G NR",
				user_res: "",
			},
			{
				ques: "3GPP Release 15",
				user_res: "",
			},
			{
				ques: "EDGE",
				user_res: "",
			},
			{
				ques: "WiMAX",
				user_res: "",
			},
		],
		res: [
			{
				ques: "5G NR",
				res: "Правильный",
			},
			{
				ques: "3GPP Release 15",
				res: "Правильный",
			},
			{
				ques: "EDGE",
				res: "",
			},
			{
				ques: "WiMAX",
				res: "",
			},
		],
	},
	{
		id: 81,
		title: "Что такое «интерфейс воздушного интерфейса» в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "Интерфейс между базовой станцией и мобильным устройством",
				user_res: "",
			},
			{
				ques: "Интерфейс между мобильным устройством и интернетом",
				user_res: "",
			},
			{
				ques: "Интерфейс между различными базовыми станциями",
				user_res: "",
			},
			{
				ques: "Интерфейс между сотовой сетью и телефонной сетью",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Интерфейс между базовой станцией и мобильным устройством",
				res: "Правильный",
			},
			{
				ques: "Интерфейс между мобильным устройством и интернетом",
				res: "",
			},
			{
				ques: "Интерфейс между различными базовыми станциями",
				res: "",
			},
			{
				ques: "Интерфейс между сотовой сетью и телефонной сетью",
				res: "",
			},
		],
	},
	{
		id: 82,
		title:
			"Какие технологии используются для увеличения покрытия и емкости сети в местах с высокой плотностью пользователей?",
		type: "check",
		body: [
			{
				ques: "Множественный вход/выход (MIMO)",
				user_res: "",
			},
			{
				ques: "Сети малой плотности",
				user_res: "",
			},
			{
				ques: "Сотовые пучки (Cellular Beams)",
				user_res: "",
			},
			{
				ques: "Сотовые переходы (Cellular Handoffs)",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Множественный вход/выход (MIMO)",
				res: "Правильный",
			},
			{
				ques: "Сети малой плотности",
				res: "",
			},
			{
				ques: "Сотовые пучки (Cellular Beams)",
				res: "Правильный",
			},
			{
				ques: "Сотовые переходы (Cellular Handoffs)",
				res: "",
			},
		],
	},
	{
		id: 83,
		title:
			"Какие параметры влияют на скорость передачи данных в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "Пропускная способность канала",
				user_res: "",
			},
			{
				ques: "Качество приема сигнала",
				user_res: "",
			},
			{
				ques: "Число подключенных абонентов",
				user_res: "",
			},
			{
				ques: "Тип используемой модуляции",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Пропускная способность канала",
				res: "Правильный",
			},
			{
				ques: "Качество приема сигнала",
				res: "Правильный",
			},
			{
				ques: "Число подключенных абонентов",
				res: "",
			},
			{
				ques: "Тип используемой модуляции",
				res: "",
			},
		],
	},
	{
		id: 84,
		title:
			"Какие технологии используются для обеспечения безопасности в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "Шифрование данных",
				user_res: "",
			},
			{
				ques: "Аутентификация пользователей",
				user_res: "",
			},
			{
				ques: "Фильтрация трафика",
				user_res: "",
			},
			{
				ques: "Двухфакторная аутентификация",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Шифрование данных",
				res: "Правильный",
			},
			{
				ques: "Аутентификация пользователей",
				res: "Правильный",
			},
			{
				ques: "Фильтрация трафика",
				res: "",
			},
			{
				ques: "Двухфакторная аутентификация",
				res: "",
			},
		],
	},
	{
		id: 85,
		title: "Какие технологии используются для передачи голоса в сетях GSM?",
		type: "check",
		body: [
			{
				ques: "PCM",
				user_res: "",
			},
			{
				ques: "AMR",
				user_res: "",
			},
			{
				ques: "VoIP",
				user_res: "",
			},
			{
				ques: "G.711",
				user_res: "",
			},
		],
		res: [
			{
				ques: "PCM",
				res: "",
			},
			{
				ques: "AMR",
				res: "Правильный",
			},
			{
				ques: "VoIP",
				res: "",
			},
			{
				ques: "G.711",
				res: "Правильный",
			},
		],
	},
	{
		id: 86,
		title:
			"Какой термин используется для описания изменения сотовой базовой станции во время передачи вызова между сотами?",
		type: "check",
		body: [
			{
				ques: "Передача голоса",
				user_res: "",
			},
			{
				ques: "Регистрация",
				user_res: "",
			},
			{
				ques: "Роуминг",
				user_res: "",
			},
			{
				ques: "Переход между сотами",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Передача голоса",
				res: "",
			},
			{
				ques: "Регистрация",
				res: "",
			},
			{
				ques: "Роуминг",
				res: "",
			},
			{
				ques: "Переход между сотами",
				res: "Правильный",
			},
		],
	},
	{
		id: 87,
		title: "Что такое «ячейка» в контексте сотовых сетей?",
		type: "check",
		body: [
			{
				ques: "Модуль мобильного устройства",
				user_res: "",
			},
			{
				ques: "Базовая станция сотовой сети",
				user_res: "",
			},
			{
				ques: "Область обслуживания базовой станции",
				user_res: "",
			},
			{
				ques: "Протокол для передачи данных",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Модуль мобильного устройства",
				res: "",
			},
			{
				ques: "Базовая станция сотовой сети",
				res: "",
			},
			{
				ques: "Область обслуживания базовой станции",
				res: "Правильный",
			},
			{
				ques: "Протокол для передачи данных",
				res: "",
			},
		],
	},
	{
		id: 88,
		title: "Какова основная цель механизма роуминга в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "Передача данных между сотовыми сетями",
				user_res: "",
			},
			{
				ques: "Обеспечение доступа к интернету",
				user_res: "",
			},
			{
				ques: "Поддержание подключения мобильного устройства к сети вне домашней зоны покрытия",
				user_res: "",
			},
			{
				ques: "Автоматическая настройка мобильного устройства",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Передача данных между сотовыми сетями",
				res: "",
			},
			{
				ques: "Обеспечение доступа к интернету",
				res: "",
			},
			{
				ques: "Поддержание подключения мобильного устройства к сети вне домашней зоны покрытия",
				res: "Правильный",
			},
			{
				ques: "Автоматическая настройка мобильного устройства",
				res: "",
			},
		],
	},
	{
		id: 89,
		title:
			"Какие технологии обычно используются для организации множественного доступа в сотовых сетях?",
		type: "check",
		body: [
			{
				ques: "FDMA",
				user_res: "",
			},
			{
				ques: "TDMA",
				user_res: "",
			},
			{
				ques: "CDMA",
				user_res: "",
			},
			{
				ques: "WCDMA",
				user_res: "",
			},
		],
		res: [
			{
				ques: "FDMA",
				res: "Правильный",
			},
			{
				ques: "TDMA",
				res: "Правильный",
			},
			{
				ques: "CDMA",
				res: "Правильный",
			},
			{
				ques: "WCDMA",
				res: "",
			},
		],
	},
	{
		id: 90,
		title: "Что такое «базовая станция» в сотовых сетях?",
		type: "check",
		body: [
			{
				ques: "Мобильное устройство",
				user_res: "",
			},
			{
				ques: "Сервер для обработки данных",
				user_res: "",
			},
			{
				ques: "Устройство для передачи и приема радиосигналов",
				user_res: "",
			},
			{
				ques: "Центр управления сетью",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Мобильное устройство",
				res: "",
			},
			{
				ques: "Сервер для обработки данных",
				res: "",
			},
			{
				ques: "Устройство для передачи и приема радиосигналов",
				res: "Правильный",
			},
			{
				ques: "Центр управления сетью",
				res: "",
			},
		],
	},
	{
		id: 91,
		title:
			"Какой протокол чаще всего используется для передачи данных в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "HTTP",
				user_res: "",
			},
			{
				ques: "FTP",
				user_res: "",
			},
			{
				ques: "TCP/IP",
				user_res: "",
			},
			{
				ques: "IPsec",
				user_res: "",
			},
		],
		res: [
			{
				ques: "HTTP",
				res: "",
			},
			{
				ques: "FTP",
				res: "",
			},
			{
				ques: "TCP/IP",
				res: "Правильный",
			},
			{
				ques: "IPsec",
				res: "",
			},
		],
	},
	{
		id: 92,
		title:
			"Какие технологии обеспечивают безопасную передачу данных в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "SSL/TLS",
				user_res: "",
			},
			{
				ques: "VPN",
				user_res: "",
			},
			{
				ques: "SSH",
				user_res: "",
			},
			{
				ques: "MACsec",
				user_res: "",
			},
		],
		res: [
			{
				ques: "SSL/TLS",
				res: "Правильный",
			},
			{
				ques: "VPN",
				res: "Правильный",
			},
			{
				ques: "SSH",
				res: "",
			},
			{
				ques: "MACsec",
				res: "Правильный",
			},
		],
	},
	{
		id: 93,
		title: "Что такое «регистрация в сети» в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "Процесс идентификации пользователя в сети",
				user_res: "",
			},
			{
				ques: "Процесс резервирования ресурсов для пользователя",
				user_res: "",
			},
			{
				ques: "Процесс определения местоположения пользователя",
				user_res: "",
			},
			{
				ques: "Процесс установления соединения между пользовательским устройством и базовой станцией",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Процесс идентификации пользователя в сети",
				res: "Правильный",
			},
			{
				ques: "Процесс резервирования ресурсов для пользователя",
				res: "",
			},
			{
				ques: "Процесс определения местоположения пользователя",
				res: "",
			},
			{
				ques: "Процесс установления соединения между пользовательским устройством и базовой станцией",
				res: "",
			},
		],
	},
	{
		id: 94,
		title:
			"Какой термин используется для обозначения передачи вызова от одной соты к другой в процессе движения пользователя?",
		type: "check",
		body: [
			{
				ques: "Регистрация",
				user_res: "",
			},
			{
				ques: "Роуминг",
				user_res: "",
			},
			{
				ques: "Переход между сотами",
				user_res: "",
			},
			{
				ques: "Передача голоса",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Регистрация",
				res: "",
			},
			{
				ques: "Роуминг",
				res: "",
			},
			{
				ques: "Переход между сотами",
				res: "Правильный",
			},
			{
				ques: "Передача голоса",
				res: "Правильный",
			},
		],
	},
	{
		id: 95,
		title:
			"Какие параметры влияют на скорость передачи данных в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "Пропускная способность канала",
				user_res: "",
			},
			{
				ques: "Качество приема сигнала",
				user_res: "",
			},
			{
				ques: "Число подключенных абонентов",
				user_res: "",
			},
			{
				ques: "Тип используемой модуляции",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Пропускная способность канала",
				res: "Правильный",
			},
			{
				ques: "Качество приема сигнала",
				res: "Правильный",
			},
			{
				ques: "Число подключенных абонентов",
				res: "Правильный",
			},
			{
				ques: "Тип используемой модуляции",
				res: "",
			},
		],
	},
	{
		id: 96,
		title: "Какие технологии используются для передачи голоса в сетях GSM?",
		type: "check",
		body: [
			{
				ques: "PCM",
				user_res: "",
			},
			{
				ques: "AMR",
				user_res: "",
			},
			{
				ques: "VoIP",
				user_res: "",
			},
			{
				ques: "G.711",
				user_res: "",
			},
		],
		res: [
			{
				ques: "PCM",
				res: "",
			},
			{
				ques: "AMR",
				res: "Правильный",
			},
			{
				ques: "VoIP",
				res: "Правильный",
			},
			{
				ques: "G.711",
				res: "Правильный",
			},
		],
	},
	{
		id: 97,
		title: "Какова основная цель механизма роуминга в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "Передача данных между сотовыми сетями",
				user_res: "",
			},
			{
				ques: "Обеспечение доступа к интернету",
				user_res: "",
			},
			{
				ques: "Поддержание подключения мобильного устройства к сети вне домашней зоны покрытия",
				user_res: "",
			},
			{
				ques: "Автоматическая настройка мобильного устройства",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Передача данных между сотовыми сетями",
				res: "",
			},
			{
				ques: "Обеспечение доступа к интернету",
				res: "",
			},
			{
				ques: "Поддержание подключения мобильного устройства к сети вне домашней зоны покрытия",
				res: "Правильный",
			},
			{
				ques: "Автоматическая настройка мобильного устройства",
				res: "",
			},
		],
	},
	{
		id: 98,
		title:
			"Какие технологии обычно используются для организации множественного доступа в сотовых сетях?",
		type: "check",
		body: [
			{
				ques: "FDMA",
				user_res: "",
			},
			{
				ques: "TDMA",
				user_res: "",
			},
			{
				ques: "CDMA",
				user_res: "",
			},
			{
				ques: "WCDMA",
				user_res: "",
			},
		],
		res: [
			{
				ques: "FDMA",
				res: "Правильный",
			},
			{
				ques: "TDMA",
				res: "Правильный",
			},
			{
				ques: "CDMA",
				res: "Правильный",
			},
			{
				ques: "WCDMA",
				res: "",
			},
		],
	},
	{
		id: 99,
		title: "Что такое «ячейка» в контексте сотовых сетей?",
		type: "check",
		body: [
			{
				ques: "Модуль мобильного устройства",
				user_res: "",
			},
			{
				ques: "Базовая станция сотовой сети",
				user_res: "",
			},
			{
				ques: "Область обслуживания базовой станции",
				user_res: "",
			},
			{
				ques: "Протокол для передачи данных",
				user_res: "",
			},
		],
		res: [
			{
				ques: "Модуль мобильного устройства",
				res: "",
			},
			{
				ques: "Базовая станция сотовой сети",
				res: "",
			},
			{
				ques: "Область обслуживания базовой станции",
				res: "Правильный",
			},
			{
				ques: "Протокол для передачи данных",
				res: "",
			},
		],
	},
	{
		id: 100,
		title:
			"Какой протокол чаще всего используется для передачи данных в мобильных сетях?",
		type: "check",
		body: [
			{
				ques: "HTTP",
				user_res: "",
			},
			{
				ques: "FTP",
				user_res: "",
			},
			{
				ques: "TCP/IP",
				user_res: "",
			},
			{
				ques: "IPsec",
				user_res: "",
			},
		],
		res: [
			{
				ques: "HTTP",
				res: "",
			},
			{
				ques: "FTP",
				res: "",
			},
			{
				ques: "TCP/IP",
				res: "Правильный",
			},
			{
				ques: "IPsec",
				res: "",
			},
		],
	},
]
